// Դուրս բերել 1-30 միայն զույգ թվերը

// for( let i = 1; i <= 30; i++ ){
//     if ( i % 2 === 0)
//     console.log(i);
// }

 
// 1-1000 թվերի շարքում 17-ի բաժանվող թվերը

// for( y = 1; y <= 1000; y++){
//     if( y % 17 === 0)
//     console.log(y);
// }

// 1-50 թվերի շարքում դուրս բերել բոլոր թվերը, բացի նրանցից որոնք բաժանվում են 19-ի

// for( x = 1; x <= 50; x++){
//     if( x % 19 !== 0 )
//     console.log(x);
// }

// 1-1000 թվերի շարքում դուրս բերել 7-ի վրա բաժանվող 123-րդ թիվը։


// let x = 0;
// let y = 1;
// while( y <= 1000){
//     if( y % 7 === 0) {
//         x++;
//         if( x === 123){
//             console.log(y);
//             break;
//         }

//     }
//     y++;
// }
// գտնել 6-ի ֆակտորիալը

// let x = 1;
// for( let i = 1; i <= 6; i++){
//     x *= i;
// }
// console.log(x);